<?php
return [
	'Create Category' => 'Создать новую категорию',
	'Create Content' => 'Создать новую страницу',
	'Delete' => 'Удалить',
	'Update' => 'Редактировать',

    'Create Co Blocks' => 'Создать новый инфо-блок',
	
	'Title' => 'Заголовок страницы',
    'Content' => 'Текст редактируемый на странице',
	'Name' => 'Название страницы',
	'Url' => 'Ссылка на страницу',
    'UrlCat' => 'Ссылка на страницу категории',
	'Category ID' => 'Принадлежность страницы к категории',
	'Active' => 'Активность',
];